
Процедура ОбновитьСодержаниеФайлов() Экспорт
	
	Выб = Справочники.Файлы.Выбрать(,,Новый Структура ("ОбновитьСодержание", Истина));
	Пока Выб.Следующий() Цикл
		
		Об = Выб.ПолучитьОбъект();
		Об.ОбменДанными.Загрузка = Истина;
		Об.ОбновитьСодержание = Ложь;
		ВременныйФайл = ПолучитьИмяВременногоФайла();
	    Об.Данные.Получить().Записать(ВременныйФайл);
		Кодировка = "ANSI";
		КодировкаФайла = КодировкаТекста[Кодировка];
		Чтение = Новый ЧтениеТекста(ВременныйФайл, КодировкаФайла);
		Об.Содержание = Чтение.Прочитать();
		Чтение.Закрыть();
		УдалитьФайлы(ВременныйФайл);
		Об.Записать();

	КонецЦикла;

КонецПроцедуры
 