
Процедура ПриЗаписи(Отказ)
	НаборЗап = РегистрыНакопления.ЗатратыПоПроектам.СоздатьНаборЗаписей();
	Отбор = Новый Структура ("Организация", Организация);
	Отбор.Вставить("Проект", Проект);
	НаборЗап.Отбор.Регистратор.Установить(Ссылка);
	НаборЗап.Прочитать();
	НаборЗап.Очистить();
	План = ПлановыеЗатраты.Расходы;
	для каждого Стр из Расходы Цикл
		Зап = НаборЗап.Добавить();
		Зап.Организация = Организация;
		Зап.Проект = Проект;
		Зап.Период = Дата;
		Зап.План = План[Стр.НомерСтроки - 1].Сумма;
		Зап.Факт = Стр.Сумма;
	конецЦикла;
	НаборЗап.Записать();
КонецПроцедуры
