
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ФИО = СтрРазделить(Объект.Наименование, " ");
	НаборЗап = РегистрыСведений.ФИО.СоздатьНаборЗаписей();
	НаборЗап.Отбор.ФизЛицо.Установить(Объект.Ссылка);
	НаборЗап.Отбор.Период.Установить(Дата);
	НаборЗап.Прочитать();
	НаборЗап.Очистить();
	Зап = НаборЗап.Добавить();
	Зап.ФизЛицо = Объект.Ссылка;
	Зап.Период = Дата;
	Зап.Фамилия = ФИО[0];
	Зап.Имя = ФИО[1];
	Зап.Отчество = ФИО[2];
	НаборЗап.Записать();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ФИОНаДату(Дата)
	ФИО = РегистрыСведений.ФИО.ПолучитьПоследнее(Дата);
	Возврат ФИО.Фамилия + " " + ФИО.Имя + " " + ФИО.Отчество;
КонецФункции



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Наименование = ФИОНаДату(Дата);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	Объект.Наименование = ФИОНаДату(Дата);
КонецПроцедуры

