
&НаСервере
Функция ЭтоДоговор(Вид)

	Возврат Вид.ЭтоДоговор;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Процедура НеобходимостьЗаполнения(Форма, ЭтоДоговор)
	
	Форма.Элементы.Контрагент.АвтоОтметкаНезаполненного = ЭтоДоговор;
	Форма.Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = ЭтоДоговор;

КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НеобходимостьЗаполнения(ЭтаФорма, ЭтоДоговор(ЭтаФорма.Объект.Вид));
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	НеобходимостьЗаполнения(ЭтаФорма, ЭтоДоговор(ЭтаФорма.Объект.Вид));
КонецПроцедуры
