
Процедура ПередЗаписью(Отказ)
	
	Если не ПустаяСтрока(Идентификатор) Тогда
	
		ТекП = ПользователиИнформационнойБазы.НайтиПоИмени(Идентификатор);
		Если ТекП = Неопределено Тогда
		
			НовПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовПользователь.Имя = Идентификатор;
			НовПользователь.ПолноеИмя = Идентификатор;
			ОбъектМетаданных = Роль.Метаданные();
			Индекс = Перечисления[ОбъектМетаданных.Имя].Индекс(Роль);
			ИмяРоли = ОбъектМетаданных.ЗначенияПеречисления[Индекс].Имя;
			НовПользователь.Роли.Добавить(Метаданные.Роли.Найти(ИмяРоли));
			НовПользователь.Записать();
		
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры
