Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)

	ТекП = ПользователиИнформационнойБазы.ТекущийПользователь();
	ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ТекП.Имя);
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ТекущийПользователь",Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", "3"));
	
	Запрос.Текст = "SELECT Вид FROM Справочник.ВнутренниеДокументы WHERE Вид IN (SELECT ВД.Ссылка FROM 
	| Справочник.ВидыДокументов ВД INNER JOIN Справочник.ВидыДокументов.РабочиеГруппы РГ ON ВД.Ссылка = РГ.Ссылка
	| INNER JOIN Справочник.Пользователи П ON РГ.РабочаяГруппа = П.РабочаяГруппа WHERE П.Ссылка = &ТекущийПользователь)";
	
	Рез = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры