
Процедура ПрохождениеПроверкиПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РезультатПроверки;
КонецПроцедуры

Процедура ПроверкаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	РезультатПроверки = Задача.УспешноЗавершена;
	Комментарий = Задача.Комментарий;
КонецПроцедуры

Процедура ПроверкаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = Автор;
	ФормируемыеЗадачи[0].Автор = Автор;
	ФормируемыеЗадачи[0].Запрос = Комментарий;
КонецПроцедуры

Процедура ВыполнитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Исполнитель = Исполнитель;
	ФормируемыеЗадачи[0].Автор = Автор;
	ФормируемыеЗадачи[0].Запрос = Комментарий;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ВыполнитьПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Комментарий = Задача.Комментарий;
КонецПроцедуры
