
&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		Сообщить("Сначала нужно записать элемент!");
		Возврат;
	КонецЕсли;
	Режим = РежимДиалогаВыбораФайла.Открытие;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите файл";
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла; 
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("Данные", Новый ДвоичныеДанные(ПутьКФайлу));
		RegExp = Новый COMОбъект("VBScript.RegExp");
		Шаблон = "\..+$";
		RegExp.Pattern = Шаблон; 
		Расширение = RegExp.Execute(Диалог.ПолноеИмяФайла).Item(0).Value;
		Расширение = СтрЗаменить(Расширение, ".", "");
		ПараметрыЗаписи.Вставить("Расширение", Расширение);
		ЗаписатьДанные(ПараметрыЗаписи);
	КонецЕсли;  
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные(ПараметрыЗаписи)
	ОбъектЭлемент = РеквизитФормыВЗначение("Объект");
	ОбъектЭлемент.Данные = Новый ХранилищеЗначения(ПараметрыЗаписи.Данные);
	ОбъектЭлемент.Расширение = ПараметрыЗаписи.Расширение;
	ОбъектЭлемент.Записать();
	ЗначениеВРеквизитФормы(ОбъектЭлемент, "Объект");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Расширение = "jpg" Тогда
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Данные"); 
	КонецЕсли;
КонецПроцедуры

