
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.ВнутренниеДокументы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"SELECT
	|	Автор.Наименование,
	|	ВД.Код,
	|	ВД.Наименование,
	|	Организация,
	|	Организация.ИНН AS ИНН,
	|	ПР.Руководитель AS ФИОРуководителя,
	|	Проект.Наименование AS ИмяПроекта,
	|	Проект.Номер AS Номер,
	|	Проект.Дата AS Дата
	|FROM
	|	Справочник.ВнутренниеДокументы ВД INNER JOIN Справочник.Подразделения.Подчиненные ПД ON ВД.Автор = ПД.Подчиненный
	|	INNER JOIN Справочник.Подразделения ПР ON ПД.Ссылка = ПР.Ссылка
	|WHERE
	|	ВД.Ссылка IN (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Дата = Формат(Выборка.Дата, "ДФ=ддММгггг");
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
